[
  {
    "id": 1,
    "title": "How to Understand Women",
    "author": "International Psychologist Organization",
    "date": "April 5, 2025",
    "excerpt": "A complete guide on how to understand women.",
    "content": ""
  },
  {
    "id": 2,
    "title": "Mastering the Art of Looking Busy at Work",
    "author": "Procrastinators United",
    "date": "April 7, 2025",
    "excerpt": "Learn to look intensely at spreadsheets while secretly watching cat videos.",
    "content": "If there's one skill every modern office warrior needs, it’s the ability to *appear* productive without actually doing much. From the perfect posture while staring blankly at graphs to the power of speed-minimizing tabs when your manager approaches — we’ve got it covered.\n\n**Inside this guide:**\n\n- How to angle your monitor so only you know you’re playing Sudoku\n- Creating fake “urgent emails” in Outlook that pop up right when someone walks by\n- Memorizing business terms like “synergy,” “bandwidth,” and “action items” to use in meetings\n\nPlus: We share real-life hacks such as scheduling Zoom meetings with yourself just to avoid work, how to set up automatic Slack replies that make you sound overwhelmed, and when it’s appropriate to carry a clipboard just to look official.\n\nProductivity? Optional.\nLooking like you care? Priceless."
  },
  {
    "id": 3,
    "title": "Cooking 101: How to Burn Water",
    "author": "Chef Clueless",
    "date": "April 8, 2025",
    "excerpt": "Discover new and exciting ways to mess up even the simplest recipes!",
    "content": "Cooking is supposed to be an act of love. But for some of us, it's a dangerous game of smoke alarms and charred mystery meat. If you’ve ever destroyed a microwave or confused salt with sugar, this guide is for you.\n\n**In this kitchen catastrophe course, you'll learn:**\n\n- How to make pasta that's both crunchy and mushy\n- The mystery of “preheating” your oven to the wrong temperature\n- Why reading the instructions is not overrated\n\nWe'll also help you understand the real purpose of a fire extinguisher in the kitchen and explore emotional healing after destroying your first homemade lasagna. You’ll get bonus tips like when to fake it with store-bought food and how to style it with parsley to look “artisanal.”\n\nCooking is like love — sometimes it burns you."
  },
  {
    "id": 4,
    "title": "How to Pretend You Know What You’re Doing in Life",
    "author": "Certified Impostor Expert",
    "date": "April 10, 2025",
    "excerpt": "Smile, nod, and never let them see your browser history.",
    "content": "Let’s face it: most of us are improvising. Adulthood doesn’t come with a tutorial, and yet here you are, holding a coffee, nodding thoughtfully in meetings, and wondering what a mortgage is.\n\n**This survival guide includes:**\n\n- How to create a “morning routine” that sounds impressive even if it’s just scrolling on your phone\n- How to avoid adult responsibilities by calling them “boundaries”\n- Strategic ways to say “I’m figuring things out” without sounding completely lost\n\nWe’ll also cover the psychology of impostor syndrome, the power of dressing one level above your confidence, and how to keep a planner on your desk that’s never actually used.\n\nRemember, it’s not about having your life together — it’s about looking like you might. And when in doubt? Say, “That’s a great question. Let me circle back on that.”"
  },
  {
    "id": 5,
    "author": "Fake User",
    "date": "May 6, 2025",
    "title": "New Example Post",
    "excerpt": "Something",
    "content": "some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content "
  },
  {
    "id": 6,
    "author": "Fake User",
    "date": "May 6, 2025",
    "title": "New Example Post",
    "excerpt": "Something",
    "content": "some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content some content "
  },
  {
    "id": 7,
    "author": "Fake User",
    "date": "May 6, 2025",
    "title": "ewrew",
    "excerpt": "rewrew",
    "content": "rewrew"
  },
  {
    "id": 8,
    "author": "Fake User",
    "date": "May 6, 2025",
    "title": "dsaf",
    "excerpt": "sadsa",
    "content": "fsadsa"
  }
]